src/cf/Catalogs/ВидыДокументовФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовФизическихЛиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодМВД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыДокументовФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Параметры.Отбор.Вставить("ПометкаУдаления",Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет справочник "Документы физических лиц" по классификатору МВД.
//
Процедура ЗаполнитьДокументыФизическихЛицПоКлассификаторуМВД() Экспорт 
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР,
		"",
		"01",
		НСтр("ru = 'ПАСПОРТ'; en = 'PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР,
		"",
		"02",
		НСтр("ru = 'ЗГПАСПОРТ'; en = 'FOREIGN PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении,
		"",
		"03",
		НСтр("ru = 'СВИД О РОЖД'; en = 'BIRTH CERTIFICATE'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера,
		"",
		"04",
		НСтр("ru = 'УДОСТ ОФИЦЕРА'; en = 'OFFICER ID'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Справка об освобождении'; en = 'Release certificate'"),
		"05",
		НСтр("ru = 'СПРАВКА ОБ ОСВ'; en = 'RELEASE CERTIFICATE'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота,
		"",
		"06",
		НСтр("ru = 'ПАСПОРТ МОРФЛТ'; en = 'MINISTRY OF MARINE PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет,
		НСтр("ru = 'Военный билет солдата (матроса, сержанта, старшины)'; en = 'Military ID of a soldier (sailor, sergeant, sergeant major)'"),
		"07",
		НСтр("ru = 'ВОЕННЫЙ БИЛЕТ'; en = 'MILITARY ID'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Временное удостоверение, выданное взамен военного билета'; en = 'A temporary certificate issued in place of a military ID card'"),
		"08",
		НСтр("ru = 'ПРОЧЕЕ'; en = 'OTHER'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт,
		"",
		"09",
		НСтр("ru = 'ДИППАСПОРТ РФ'; en = 'RF DIPLOMATIC PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Иностранный паспорт'; en = 'Foreign passport'"),
		"10",
		НСтр("ru = 'ИНПАСПОРТ'; en = 'FOREIGN PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Свидетельство о регистрации ходатайства иммигранта о признании его беженцем'; en = ""Certificate of registration of an immigrant's application for recognition as a refugee"""),
		"11",
		НСтр("ru = 'СВИД БЕЖЕНЦА'; en = 'REFUGEE CERTIFICATE'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Вид на жительство'; en = 'Resident card'"),
		"12",
		НСтр("ru = 'ВИД НА ЖИТЕЛЬ'; en = 'LAWFUL PERMANENT RESID'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Удостоверение беженца'; en = 'Refugee certificate'"),
		"13",
		НСтр("ru = 'УДОСТ БЕЖЕНЦА'; en = 'REFUGEE CERTIFICATE'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Временное удостоверение личности гражданина РФ'; en = 'Temporary identity card of a citizen of the Russian Federation'"),
		"14",
		НСтр("ru = 'ВРЕМ УДОСТ'; en = 'TEMP CERTIF'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Разрешение на временное проживание в Российской Федерации'; en = 'Temporary residence permit in the Russian Federation'"),
		"15",
		НСтр("ru = 'ПРОЧЕЕ'; en = 'OTHER'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Свидетельство о предоставлении временного убежища на территории Российской Федерации'; en = 'Certificate of temporary asylum in the Russian Federation'"),
		"18",
		НСтр("ru = 'ПРОЧЕЕ'; en = 'OTHER'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ,
		"",
		"21",
		НСтр("ru = 'ПАСПОРТ РОССИИ'; en = 'RUSSIAN PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ,
		"",
		"22",
		НСтр("ru = 'ЗГПАСПОРТ РФ'; en = 'RF FOREIGN PASSPORT'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Свидетельство о рождении, выданное уполномоченным органом иностранного государства'; en = 'A birth certificate issued by an authorized body of a foreign state'"),
		"23",
		НСтр("ru = 'ПРОЧЕЕ'; en = 'OTHER'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Удостоверение личности военнослужащего Российской Федерации'; en = 'Identity card of a military serviceman of the Russian Federation'"),
		"24",
		НСтр("ru = 'ПРОЧЕЕ'; en = 'OTHER'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка,
		"",
		"26",
		НСтр("ru = 'ПАСПОРТ МОРЯКА'; en = ""SAILOR'S PASSPORT""")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса,
		"",
		"27",
		НСтр("ru = 'БИЛЕТ ОЗ'; en = 'RO MILITARY ID '")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru = 'Иные документы, выдаваемые органами МВД'; en = 'Other documents issued by the Ministry of Internal Affairs'"),
		"91",
		НСтр("ru = 'ПРОЧЕЕ'; en = 'OTHER'")
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьОбновитьДокументФизЛиц(СсылкаНаЭлемент = Неопределено, Наименование = "", КодМВД = "", КодПФР = "")
	
	Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Если Наименование = "" Тогда
			Возврат
		КонецЕсли;
		
		СсылкаНаЭлемент = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "КодМВД, КодПФР");
		Если ДанныеИБ.КодМВД = КодМВД И ДанныеИБ.КодПФР = КодПФР Тогда
			Возврат
		КонецЕсли;
		
		Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
		
	Иначе
		Элемент = Справочники.ВидыДокументовФизическихЛиц.СоздатьЭлемент();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	
	Элемент.КодМВД = КодМВД;
	Элемент.КодПФР = КодПФР;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
